EDA: explaratory data analysis meaning understanding and analyzing our dataset

Why EDA?
Before we use algorithms & model it to our dataset we need to know insights about our like number of rows,columns , any missing , null values
to explore more and interpret on our data we need to perform EDA

In [2]:
import pandas as pd

In [7]:
dataset=pd.read_csv(r"D:\BE\ML\datasets\petrol.csv")

In [8]:
dataset.head()

        city        date   rate      state
0  Hyderabad  2011-12-01  73.07  Telangana
1  Hyderabad  2012-04-01  73.08  Telangana
2  Hyderabad  2012-05-24  81.44  Telangana
3  Hyderabad  2012-06-03  78.11  Telangana
4  Hyderabad  2012-06-29  74.89  Telangana

In [9]:
dataset.tail()

        city        date  rate        state
5043  Mumbai  2020-12-27  90.3  Maharashtra
5044  Mumbai  2020-12-28  90.3  Maharashtra
5045  Mumbai  2020-12-29  90.3  Maharashtra
5046  Mumbai  2020-12-30  90.3  Maharashtra
5047  Mumbai  2020-12-31  90.3  Maharashtra

In [10]:
dataset.describe()

              rate
count  5048.000000
mean     75.965413
std       8.146900
min      23.100000
25%      72.610000
50%      76.120000
75%      81.120000
max      91.390000